intake_c_ssrs_rename = {
    'c_ssrs_1_life': 'כל החיים: האם קיווית למות או ללכת לישון מבלי להתעורר?',
    'c_ssrs_2_life' : 'כל החיים: האם היו לך מחשבות להרוג את עצמך?',
    'c_ssrs_3_life': ' האם חשבת איך לעשות את זה:כל החיים',
    'c_ssrs_4_life': 'כל החיים: האם היו לך כוונות אכן לפעול לפי המחשבות של להרוג את עצמך?',
    'c_ssrs_5_life': 'כל החיים: האם התחלת לתכנן או שכבר סגרת את פרטי התוכנית',
    'c_ssrs_6_life': 'כל החיים: האם עשית משהו, התחלת לעשות משהו',
    'c_ssrs_1_2weeks': 'שבועיים: האם קיווית למות או ללכת לישון מבלי להתעורר?', 
    'c_ssrs_2_2weeks': 'שבועיים: האם היו לך מחשבות להרוג את עצמך?',
    'c_ssrs_3_2weeks': 'שבועיים: האם חשבת איך לעשות את זה',
    'c_ssrs_4_2weeks': 'שבועיים: האם היו לך כוונות אכן לפעול לפי המחשבות של להרוג את עצמך',
    'c_ssrs_5_2weeks': 'שבועיים: האם התחלת לתכנן או שכבר סגרת את פרטי התוכנית',
    'c_ssrs_6_2weeks': 'שבועיים: האם עשית משהו, התחלת לעשות משהו',
    'c_ssrs_6_3month': '3 חודשים: האם עשית משהו, התחלת לעשות משהו',
    'c_ssrs_7_intake': 'חודש: כמה פעמים עשית?',
    'c_ssrs_8_intake': 'כל החיים: כמה פעמים עשית?'}

c_ssrs_rename = {
    'c_ssrs_1': ' האם קיווית ללכת למות או ללכת לישון מבלי להתעורר?',
    'c_ssrs_2':' האם היו לך מחשבות להרוג את עצמך?',
    'c_ssrs_3': ' האם חשבת איך לעשות את זה',
    'c_ssrs_4': ' האם היו לך כוונות אכן לפעול לפי המחשבות של להרוג את עצמך',
    'c_ssrs_5': 'האם התחלת לתכנן או שכבר סגרת את פרטי התוכנית',
    'c_ssrs_6': 'האם עשית משהו, התחלת לעשות משהו',
    'c_ssrs_last_visit_6': 'מאז ביקור אחרון: האם עשית משהו, התחלת לעשות משהו',
    'c_ssrs_7': 'בחודש האחרון, כמה פעמים עשית משהו מכל הדברים האלו?',
    'c_ssrs_8': 'במשך כל חייך, כמה פעמים עשית משהו מכל הדברים האלו?'

}

mfq_rename = {
     'mfq_1': 'הרגשתי נורא',
     'mfq_2': 'לא נהניתי',
     'mfq_5': 'עייף',
     'mfq_7': 'חסרת מנוחה',
     'mfq_8': 'שאני לא שווה',
     'mfq_14': 'בכיתי הרבה',
     'mfq_21': 'קשה להתרכז',
     'mfq_23': 'שנאה עצמית',
     'mfq_24': 'שאני בן אדם רע',
     'mfq_27': 'הרגשתי בודדה',
     'mfq_28': 'לא אוהבים אותי',
     'mfq_30': 'לא אהיה טוב כמו אחרים',
     'mfq_31': 'כל מה שעשיתי לא טוב',
     'mfq_34': 'האם ניסית להתאבד?',
     'mfq_35': 'האם פגעת בעצמך?',
     'mfq_36': 'חודש: האם ניסית להתאבד',
     'mfq_37': 'חודש" האם פגעת בעצמך'
     }


siq_rename = {
    'siq_1': 'עדיף אם לא הייתי בחיים',
 'siq_2': 'להרוג את עצמי',
 'siq_3': 'איך אהרוג את עצמי',
 'siq_4': 'מתי אהרוג את עצמי',
 'siq_5': 'על אנשים שמתים',
 'siq_6': 'על המוות',
 'siq_7': 'מכתב התאבדות',
 'siq_8': 'על צוואה',
 'siq_9': 'לספר לאנשים',
 'siq_10': 'איך ירגישו אם אתאבד',
 'siq_11': 'הלוואי שהייתי מת',
 'siq_12': 'להתאבד יפתור בעיות',
 'siq_13': 'לאחרים עדיף שאמות',
 'siq_14': 'הלוואי שלא הייתי נולדת',
 'siq_15': 'לא אכפת אם אני אמות',
}

sdq_rename = {
 'sdq_1': '',
 'sdq_2': '',
 'sdq_3': '',
 'sdq_4': '',
 'sdq_5': '',
 'sdq_6': '',
 'sdq_7': '',
 'sdq_8': '',
 'sdq_9': '',
 'sdq_10': '',
 'sdq_11': '',
 'sdq_12': '',
 'sdq_13': '',
 'sdq_14': '',
 'sdq_15': '',
 'sdq_16': '',
 'sdq_17': '',
 'sdq_18': '',
 'sdq_19': '',
 'sdq_20': '',
 'sdq_21': '',
 'sdq_22': '',
 'sdq_23': '',
 'sdq_24': '',
 'sdq_25': ''

}